{"movieNo7":{"Title":"Star Wars: Episode IV - A New Hope","imdbRating":"8.6","Released":"1977","Genre":"Action, Adventure, Fantasy, Sci-Fi","Plot":"Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader."},"movieNo5":{"Title":"Shrek","imdbRating":"7.8","Released":"2001","Genre":"Animation, Adventure, Comedy, Family, Fantasy","Plot":"A mean lord exiles fairytale creatures to the swamp of a grumpy ogre, who must go on a quest and rescue a princess for the lord in order to get his land back."},"movieNo6":{"Title":"Shrek 2","imdbRating":"7.2","Released":"2004","Genre":"Animation, Adventure, Comedy, Family, Fantasy, Romance","Plot":"Shrek and Fiona travel to the Kingdom of Far Far Away, where Fiona's parents are King and Queen, to celebrate their marriage. When they arrive, they find they are not as welcome as they thought they would be."},"movieNo3":{"Title":"Iron Man","imdbRating":"7.9","Released":"2008","Genre":"Action, Adventure, Sci-Fi","Plot":"After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil."},"movieNo4":{"Title":"Iron Man 2","imdbRating":"7.0","Released":"2010","Genre":"Action, Adventure, Sci-Fi","Plot":"With the world now aware of his identity as Iron Man, Tony Stark must contend with both his declining health and a vengeful mad man with ties to his father's legacy."},"movieNo1":{"Title":"Batman","imdbRating":"7.5","Released":"1989","Genre":"Action, Adventure","Plot":"The Dark Knight of Gotham City begins his war on crime with his first major enemy being Jack Napier, a criminal who becomes the clownishly homicidal Joker."},"movieNo2":{"Title":"Gladiator","imdbRating":"8.5","Released":"2000","Genre":"Action, Adventure, Drama","Plot":"A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery."}}